<?php
/**
 * Нужно написать код, который из массива выведет то что приведено ниже в комментарии.
 */
$x = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'];

$len = count($x);
$x[0] = [$x[0] => ''];

for ($i = 1; $i < $len; $i++) {

    $x[$i] = [$x[$i] => $x[$i-1]];
    unset($x[$i-1]);

    if ($i == $len-1) {
        $x = $x[$i];
    }
}
print_r($x);
/*
print_r($x) - должен выводить это:
Array
(
    [h] => Array
        (
            [g] => Array
                (
                    [f] => Array
                        (
                            [e] => Array
                                (
                                    [d] => Array
                                        (
                                            [c] => Array
                                                (
                                                    [b] => Array
                                                        (
                                                            [a] =>
                                                        )

                                                )

                                        )

                                )

                        )

                )

        )

);*/
